Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཀློག་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པའོ། །གཉིས་ལ་སྤྱོད་པ་ཡང་མ་ཡིན། མི་གཉིས་པ་ལ་སྤྱོད་པ་ཡང་མ་ཡིན་པའི་བློས། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པའོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་སུམ་ཅུ་ལྔ་བ། གཉིས་ལ་སྤྱོད་པ་ཡང་མ་ཡིན། མི་གཉིས་པ་ལ་སྤྱོད་པ་ཡང་མ་ཡིན་པའི་བློས། དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་།
en: It entails that the mind, without engaging in duality and without engaging in nonduality, focuses the attention correctly on [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities. “

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པའོ།
en: It entails that the mind, without engaging in duality and without engaging in nonduality, focuses the attention correctly on the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path.

source: །གཉིས་ལ་སྤྱོད་པ་ཡང་མ་ཡིན། མི་གཉིས་པ་ལ་སྤྱོད་པ་ཡང་མ་ཡིན་པའི་བློས། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་བར་དུ་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པའོ།
en: It entails that the mind, without engaging in duality and without engaging in nonduality, focuses the attention correctly on [the fruitional attributes], up to and including the distinct qualities of the buddhas.

source: །གཉིས་ལ་སྤྱོད་པ་ཡང་མ་ཡིན། མི་གཉིས་པ་ལ་སྤྱོད་པ་ཡང་མ་ཡིན་པའི་བློས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པའོ། །ཀཽ་ཤི་ཀ་གཞན་ཡང་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག །
en: It entails that the mind, without engaging in duality and without engaging in nonduality, focuses the attention correctly on [the goals], up to and including all-aspect omniscience. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གཞན་ལ་རྣམ་གྲངས་དུ་མར་རྒྱ་ཆེར་རྗོད་ཅིང་སྟོན་ལ། འཆད་ཅིང་འགྲེལ་བ་དང་། རྣམ་པར་འབྱེད་ཅིང་གསལ་བར་བྱེད་ལ། ཡང་དག་པར་སྟོན་ཅིང་དེའི་དོན་གཏན་ལ་དབབ་པ་སྟོན་པ་བྱེད་ན། ཀཽ་ཤི་ཀ་དེ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་དོན་ནི་འདི་ཡིན་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གཉིས་སུ་བལྟ་བ་མ་ཡིན། གཉིས་སུ་མེད་པར་བལྟ་བ་མ་ཡིན།
en: Moreover, Kauśika, if any noble son or noble daughter were to extensively describe this perfection of wisdom to others using many formulations, and teach, explain, interpret, analyze, and elucidate it, revealing it authentically and establishing its meaning, then, Kauśika, the meaning of the perfection of wisdom [that they would reveal] would be as follows: The perfection of wisdom observes neither duality nor nonduality.

source: མཚན་མར་མ་ཡིན། མཚན་མ་མེད་པར་མ་ཡིན།
en: It is neither with signs nor without signs.

source: བླང་བར་མ་ཡིན། དོར་བར་མ་ཡིན།
en: It is neither to be accepted nor to be rejected.

source: དབྲི་བར་མ་ཡིན། བསྣན་པར་མ་ཡིན།
en: It is without decrease and without increase.

source: ཀུན་ནས་ཉོན་མོངས་པར་མ་ཡིན། རྣམ་པར་བྱང་བར་མ་ཡིན།
en: It is without affliction and without purification.

source: སྐྱེ་བར་མ་ཡིན། འགག་པར་མ་ཡིན།
en: It neither arises nor ceases.

source: གཟུང་བར་མ་ཡིན། མི་གཟུང་བར་མ་ཡིན།
en: It is neither grasped nor is it not grasped.

source: ལེན་པར་མ་ཡིན། དོར་བར་མ་ཡིན།
en: It is neither adopted nor is it abandoned.

source: གནས་པར་མ་ཡིན། མི་གནས་པར་མ་ཡིན།
en: It neither dwells not does it not dwell.

source: ཡང་དག་པར་མ་ཡིན། ལོག་པར་མ་ཡིན།
en: It is neither authentic nor is it erroneous.

source: ལྡན་པར་མ་ཡིན། མི་ལྡན་པར་མ་ཡིན།
en: It is neither conjoined nor is it disjoined.

source: འདྲེ་བར་མ་ཡིན། མི་འདྲེ་བར་མ་ཡིན།
en: It is neither hybrid nor is it not hybrid.

source: རྐྱེན་དུ་མ་ཡིན། རྐྱེན་མེད་པར་མ་ཡིན།
en: It is neither conditional nor is it unconditional.

source: ཆོས་སུ་མ་ཡིན། ཆོས་མ་ཡིན་པར་མ་ཡིན།
en: It is neither something nor is it nothing.

source: དེ་བཞིན་ཉིད་དུ་མ་ཡིན། དེ་བཞིན་ཉིད་མ་ཡིན་པར་མ་ཡིན།
en: It is neither the real nature nor is it not the real nature.

source: ཡང་དག་པའི་མཐའ་མ་ཡིན། ཡང་དག་པའི་མཐའ་མ་ཡིན་པར་མ་ཡིན་ཏེ།
en: It is neither the very limit of reality nor is it not the very limit of reality.

source: འདི་ནི་གཉིས་སུ་མེད་པའི་དོན་ཏོ།
en: That is to say, it is without dualities.

source: །རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གཞན་ལ་རྒྱ་ཆེར་རྗོད་ཅིང་སྟོན་ལ། འཆད་ཅིང་འགྲེལ་པ་དང་། རྣམ་པར་འབྱེད་ཅིང་གསལ་བར་བྱེད་ལ། ཡང་དག་པར་སྟོན་པར་བྱེད་ཅིང་། དེའི་དོན་གཏན་ལ་དབབ་པར་སྟོན་ན། བསོད་ནམས་མང་དུ་འཕེལ་གྱི། བདག་འབའ་ཤིག་གིས་བཟུང་བའམ། ཀུན་ཆུབ་པར་བྱས་པའམ། བཅངས་པའམ། བླགས་པའམ། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱས་པས་ནི་མ་ཡིན་ནོ། །ཀཽ་ཤི་ཀ་གཞན་ཡང་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་བདག་ཉིད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འཛིན་ཅིང་། ཀུན་ཆུབ་པར་བྱེད་དེ། འཆང་ཞིང་ཀློག་ལ། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་ཅིང་།
en: If any noble sons or noble daughters were to extensively describe this perfection of wisdom to others, and teach, explain, interpret, analyze, and elucidate it, revealing it authentically and establishing its meaning in that manner, then, Kauśika, their merit would greatly increase, more so than [the merit of] those who take up, master, uphold, read, and focus their attention correctly on it, exclusively for themselves. “

source: གཞན་ལ་ཡང་རྒྱ་ཆེར་རྗོད་ཅིང་སྟོན་ལ། འཆད་ཅིང་འགྲེལ་བ་དང་། རྣམ་པར་འབྱེད་ཅིང་གསལ་བར་བྱེད་ལ། ཡང་དག་པར་སྟོན་པར་བྱེད་ཅིང་། དེའི་དོན་གཏན་ལ་དབབ་པར་སྟོན་ན།
en: Moreover, Kauśika, if any noble sons or noble daughters were to take up, master, uphold, recite, and focus their attention correctly on this profound perfection of wisdom for themselves, and also extensively describe it to others, and teach, explain, interpret, analyze, and elucidate it, revealing it authentically and establishing its meaning in that manner, then Kauśika, the merit of those noble sons or noble daughters would greatly increase to its utmost.”

source: ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་ནི་ཤིན་དུ་མང་དུ་འཕེལ་ལོ། །བརྒྱ་བྱིན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ལྟར་དོན་དང་ལྡན་ལ་ཡི་གེ་དང་ལྡན་པར་བསྟན་པར་བགྱི་འམ།
en: Śakra then asked, “Blessed Lord, should the noble sons or noble daughters reveal the perfection of wisdom in accordance with its meaning and its letters?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ལྟར་དོན་དང་ལྡན། ཡི་གེ་དང་ལྡན་པར་བསྟན་པར་བྱ་སྟེ། ཀཽ་ཤི་ཀ་དེ་ལྟར་སྟོན་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཚད་མེད་གྲངས་མེད་པ་དང་ལྡན་པར་འགྱུར་རོ། །ཀཽ་ཤི་ཀ་གལ་ཏེ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ལ་ལས་
en: Kauśika,” replied the Blessed One, “the noble sons or noble daughters should reveal the perfection of wisdom in accordance with its meaning and its letters.

source: ཕྱོགས་བཅུ་ཀུན་གྱི་ཕྱོགས་རེ་རེ་ཞིང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཚད་མེད། གྲངས་མེད་པ་དག་ལ། ནམ་འཚོའི་བར་དུ་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་དང་། བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་རིམ་གྲོར་བྱས་པ་དང་།
en: Kauśika, {Ki.

source: བཀུར་སྟིར་བྱས་པ་དང་། བསྟི་སྟང་དུ་བྱས་པ་དང་། མཆོད་པ་བྱས་པ་བས། ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས།
en: II-III: 109} the noble sons or noble daughters who reveal it in that manner will possess an immeasurable and incalculable heap of merit. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གཞན་ལ་རྒྱ་ཆེར་དོན་དང་ལྡན། ཡི་གེ་དང་ལྡན་པར་རྣམ་གྲངས་དུ་མར་བརྗོད་དེ་བསྟན་པ་དང་། བཤད་དེ་བཀྲོལ་ཞིང་རྣམ་པར་ཕྱེ་སྟེ་གསལ་བ་དང་། ཡང་དག་པར་བསྟན་པ་བྱས་ན། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེ་ནི་ཆེས་མང་དུ་འཕེལ་ལོ།
en: Kauśika, if any noble sons or noble daughters were, for the duration of their lives, to serve, respect, honor, and worship the immeasurable, countless tathāgatas, arhats, completely awakened buddhas in each of all the ten directions with flowers, garlands, perfume, unguents, powders, robes, parasols, victory banners, ribbons, diverse musical sounds, and all comforts, compared to them, Kauśika, if any noble sons or noble daughters were to extensively describe this perfection of wisdom in accordance with its meaning and its letters by many means to others, and teach, explain, interpret, analyze, and elucidate it, revealing it authentically and establishing its meaning in that manner, then, Kauśika, the merit of those noble sons or noble daughters would increase more than those of the former.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་བསླབས་ཏེ། འདས་པ་དང་མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །ཀཽ་ཤི་ཀ་གཞན་ཡང་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལས།
en: If you ask why, having trained in this perfection of wisdom, the tathāgatas, arhats, completely awakened buddhas of the past, future, and present have attained, will attain, and are attaining consummate buddhahood in unsurpassed, complete enlightenment. “

source: བསྐལ་པ་ཚད་མེད་གྲངས་མེད་པར་དམིགས་པའི་ཚུལ་གྱིས། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་བས་ནི། གང་ལ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདིའི་དོན་དང་ལྡན། ཡི་གེ་དང་ལྡན་པར་མི་དམིགས་པའི་ཚུལ་གྱིས། གཞན་ལ་རྒྱ་ཆེར་བརྗོད་ཅིང་སྟོན་ལ་འཆད་ཅིང་རྣམ་པར་འགོད་པ་དང་།
en: Moreover, Kauśika, compared to any noble sons or noble daughters who, over immeasurable, countless eons, practice the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom by way of apprehending, if any extensively describe this perfection of wisdom in accordance with its meaning and its letters to others, and teach, explain, establish, investigate, analyze, and elucidate it, revealing it authentically, without apprehending anything, the merit of the latter will increase even more. “

source: རབ་ཏུ་འགོད་ཅིང་རྣམ་པར་འབྱེད་ལ། གསལ་བར་བྱེད་ཅིང་ཡང་དག་པར་སྟོན་པ་བྱེད་ན། དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ། །དེ་ལ་དམིགས་པ་ནི་འདི་ཡིན་ཏེ། ཀཽ་ཤི་ཀ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་དམིགས་པའི་ཚུལ་གྱིས་སྦྱིན་པ་གཏོང་ཞིང་འདི་སྙམ་དུ་བདག་ནི་སྦྱིན་པ་གཏོང་ངོ་།
en: In this regard, Kauśika, if bodhisattvas offer gifts by way of apprehending, and think, ‘I am offering gifts!

source: །སྦྱིན་པ་ནི་འདི་གཏོང་ངོ་།
en: These are the gifts that I am offering!

source: །འདི་ལ་ནི་སྦྱིན་པར་བྱའོ་སྙམ་ན།
en: They are to be offered to that recipient!’

source: དེས་སྦྱིན་པ་དེ་ལྟར་བཏང་བས་སྦྱིན་པ་ཉིད་དུ་འགྱུར་གྱི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན་ནོ།
en: then by offering their gifts in that manner they will resort to generosity, but that is not the perfection of generosity.

source: །བདག་ནི་ཚུལ་ཁྲིམས་སྲུང་ངོ་། །ཚུལ་ཁྲིམས་ནི་འདི་སྲུང་ངོ་སྙམ་ན།
en: If they think, ‘I am maintaining ethical discipline! This is the ethical discipline I maintain!’

source: དེས་ཚུལ་ཁྲིམས་དེ་ལྟར་བསྲུངས་བས། ཚུལ་ཁྲིམས་ཉིད་དུ་འགྱུར་གྱི། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན་ནོ།
en: then by maintaining ethical discipline in that manner they will resort to ethical discipline, but that is not the perfection of ethical discipline.

source: །བདག་ནི་བཟོད་པ་སྒོམ་མོ།
en: If they think, ‘I am cultivating tolerance!

source: །བཟོད་པ་འདི་སྒོམ་མོ་སྙམ་ན།
en: This is the tolerance I cultivate!’

source: དེས་བཟོད་པ་དེ་ལྟར་བསྒོམས་པས། བཟོད་པ་ཉིད་དུ་འགྱུར་གྱི། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན་ནོ།
en: then by cultivating tolerance in that manner they will resort to tolerance, but that is not the perfection of tolerance.

source: །བདག་ནི་བརྩོན་འགྲུས་རྩོམ་མོ།
en: If they think, ‘I am persevering!

source: །འདིའི་དོན་དུ་བརྩོན་འགྲུས་བརྩམ་མོ་སྙམ་ན།
en: This is the object for which I undertake perseverance!’

source: དེས་བརྩོན་འགྲུས་དེ་ལྟར་བརྩམས་པས། བརྩོན་འགྲུས་ཉིད་དུ་འགྱུར་གྱི། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན་ནོ།
en: then by undertaking perseverance in that manner they will resort to perseverance, but that is not the perfection of perseverance.

source: །བདག་ནི་བསམ་གཏན་རྣམས་ལ་སྙོམས་པར་འཇུག་གོ།
en: If they think, ‘I am absorbed in the meditative concentrations!

source: །བསམ་གཏན་ནི་འདི་དག་ལ་མཉམ་པར་གཞག་གོ །སྙམ་ན།
en: These are the meditative concentrations in which I am absorbed!’

source: དེས་བསམ་གཏན་ལ་དེ་ལྟར་མཉམ་པར་བཞག་པས། བསམ་གཏན་ཉིད་དུ་འགྱུར་གྱི། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན་ནོ།
en: then by being absorbed in meditative concentration in that manner they will resort to meditative concentration, but that is not the perfection of meditative concentration.

source: །བདག་ནི་ཤེས་རབ་སྒོམ་མོ། །ཤེས་རབ་ནི་འདི་བསྒོམ་མོ་སྙམ་ན།
en: If they think, ‘I am cultivating wisdom!

source: དེས་ཤེས་རབ་དེ་ལྟར་བསྒོམས་པས་ཤེས་རབ་ཉིད་དུ་འགྱུར་གྱི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན་ནོ། །ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེ་ལྟར་དམིགས་པ་ལ་སྤྱད་པས་ནི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ། ཡོངས་སུ་རྫོགས་པར་མི་འགྱུར་རོ།
en: This is the wisdom I am cultivating’ then by cultivating wisdom in that manner they will resort to wisdom, but that is not the perfection of wisdom. “

source: །ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་མི་འགྱུར་རོ།
en: Kauśika, noble sons or noble daughters who engage in apprehending in that manner do not complete the perfection of generosity, and they do not complete the perfections of ethical discipline, tolerance, perseverance, meditative concentration, or wisdom.”

source: །བརྒྱ་བྱིན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། ཇི་ལྟར་སྤྱད་ན། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར། ཇི་ལྟར་སྤྱད་ན།
en: Śakra then asked, “Blessed Lord, how then should bodhisattva great beings act so as to complete the perfection of generosity?

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར། ཇི་ལྟར་སྤྱད་ན།
en: How should they act so as to complete the perfection of ethical discipline?

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར། ཇི་ལྟར་སྤྱད་ན།
en: How should they act so as to complete the perfection of tolerance? {Ki.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར། ཇི་ལྟར་སྤྱད་ན།
en: II-III: 110} How should they act so as to complete the perfection of perseverance?

source: བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར། ཇི་ལྟར་སྤྱད་ན།
en: How should they act so as to complete the perfection of meditative concentration?

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར།
en: How should they act so as to complete the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་འདི་ལ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་གཏོང་བའི་ཚེ། ཡོངས་སུ་གཏོང་བ་མི་དམིགས། སྦྱིན་པ་དང་ལེན་པ་མི་དམིགས་སོ།
en: Kauśika,” replied the Blessed One, “in this regard, when bodhisattva great beings give gifts, they do not apprehend [the act of] giving and they do not apprehend the giver or the recipient.

source: །ཚུལ་ཁྲིམས་སྲུང་བའི་ཚེ། ཚུལ་ཁྲིམས་དང་། ཚུལ་ཁྲིམས་ཡང་དག་པར་བླང་བར་མི་དམིགས་སོ།
en: When they maintain ethical discipline, they do not apprehend ethical discipline or the adopting of ethical discipline.

source: །བཟོད་པ་སྒོམ་པའི་ཚེ། བཟོད་པ་དང་། བཟོད་པ་བསྒོམ་པ་མི་དམིགས་སོ།
en: When they cultivate tolerance, they do not apprehend tolerance or the cultivation of tolerance.

source: །བརྩོན་འགྲུས་རྩོམ་པའི་ཚེ། བརྩོན་འགྲུས་དང་། བརྩོན་འགྲུས་རྩོམ་པ་མི་དམིགས་སོ།
en: When they undertake perseverance, they do not apprehend perseverance or the undertaking of perseverance.

source: །བསམ་གཏན་ལ་སྙོམས་པར་འཇུག་པའི་ཚེ། བསམ་གཏན་དང་བསམ་གཏན་སྒོམ་པ་མི་དམིགས་སོ།
en: When they become absorbed in meditative concentration, they do not apprehend meditative concentration or the cultivation of meditative concentration.

source: །ཤེས་རབ་སྒོམ་པའི་ཚེ། ཤེས་རབ་དང་ཤེས་རབ་བསྒོམ་པ་དང་། ཤེས་རབ་དང་ལྡན་པ་མི་དམིགས་སོ།
en: When they cultivate wisdom, they do not apprehend wisdom, the cultivation of wisdom, or the one who has wisdom.

source: །ཀཽ་ཤི་ཀ་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Kauśika, bodhisattva great beings who practice in that manner complete the perfection of generosity and they complete the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom. “

source: །ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་ལྟར་ཁོང་དུ་ཆུད་པ་མེད་པར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དོན་དང་ལྡན་ཡི་གེ་དང་ལྡན་པར་བསྟན་པར་བྱའོ། །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Kauśika, noble sons or noble daughters should reveal the perfection of wisdom in accordance with its meaning and its letters, without comprehending it in that [aforementioned dualistic] manner, and they should [likewise] reveal the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྟན་པར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་མ་འོངས་པའི་དུས་ན་རིགས་ཀྱི་བུའམ་རིགས་བུ་མོ་ལ་ལ། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གཟུགས་བརྙན་སྟོན་པ་འབྱུང་སྟེ།
en: If you ask why, Kauśika, in the future there will be certain noble sons or noble daughters who teach an imitation of the perfection of wisdom to followers of the vehicle of the bodhisattvas.

source: དེར་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཞུགས་པ་དེ་དག་གིས་ཀྱང་གཟུགས་བརྙན་དེ་ཐོས་ནས། ལམ་སྟོན་པར་འགྱུར་ཏེ། དེ་དག་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དོན་དང་ལྡན། ཡི་གེ་དང་ལྡན་པར་བསྟན་པར་བྱའོ།
en: Thereupon, any noble sons or noble daughters who have set out for unsurpassed, complete enlightenment will indeed teach the [authentic] path when they hear that imitation, and should reveal to them this perfection of wisdom in accordance with its meaning and its letters.”

source: །བརྒྱ་བྱིན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གཟུགས་བརྙན་གང་ལགས།
en: Śakra then asked, “Blessed Lord, what is this imitation of the perfection of wisdom?” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་འདི་ལ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དག །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྟན་ཏོ། །སྙམ་ཞིང་དེ་དག་གཟུགས་བརྙན་སྟོན་པ་བྱེད་པའོ།
en: In this regard, Kauśika,” replied the Blessed One, “noble sons or noble daughters may think that they are revealing the perfection of wisdom, but they actually reveal its imitation.”

source: །བརྒྱ་བྱིན་གྱིས་གསོལ་པ་བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གཟུགས་བརྙན་སྟོན་པ་ལགས།
en: Śakra asked, “Blessed Lord, how do those noble sons or noble daughters reveal an imitation of the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་འདི་ལ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོན་པར་བྱེད་པའི་ཚེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གཟུགས་བརྙན་སྟོན་ཏེ།
en: Kauśika,” replied the Blessed One, “in this regard, when those noble sons or noble daughters reveal the perfection of wisdom, they teach an imitation of perfection of wisdom.

source: དེ་ལ་འདི་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གཟུགས་བརྙན་ཏེ། འདི་ལྟར་གཟུགས་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན། གཟུགས་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་། བདག་མེད་དོ་ཞེས་བྱ་བ་དང་། མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན།
en: Their imitation of the perfection of wisdom is as follows: They teach that physical forms are impermanent and they teach that physical forms are imbued with suffering, without self, and unpleasant.

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་། བདག་མེད་དོ་ཞེས་བྱ་བ་དང་། མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན་ཅིང་།
en: They teach that feelings, perceptions, formative predispositions, and consciousness are impermanent, and they teach that feelings, perceptions, formative predispositions, and consciousness are imbued with suffering, without self, and unpleasant.

source: འདི་སྐད་དུ་གང་དེ་ལྟར་སྤྱོད་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ་ཞེས་བརྗོད་དེ།
en: They say that those who act accordingly practice the perfection of wisdom.

source: སུ་ལ་བསྟན་པ་དེ་དག་ཀྱང་གཟུགས་མི་རྟག་ཅེས་བྱ་བར་རྟོག་པར་འགྱུར་རོ།
en: Those to whom that is taught will also think that physical forms are impermanent.

source: །གཟུགས་སྡུག་བསྔལ་ཞེས་བྱ་བ་དང་བདག་མེད་ཅེས་བྱ་བ་དང་མི་སྡུག་ཅེས་བྱ་བར་རྟོག་པར་འགྱུར་རོ།
en: They will think that physical forms are imbued with suffering, without self, and unpleasant.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མི་རྟག་ཅེས་བྱ་བར་རྟོག་པར་འགྱུར་རོ། །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་སྡུག་བསྔལ་ཞེས་བྱ་བ་དང་བདག་མེད་ཅེས་བྱ་བ་དང་མི་སྡུག་ཅེས་བྱ་བར་རྟོག་པར་འགྱུར་རོ།
en: They will think that feelings, perceptions, formative predispositions, and consciousness are impermanent, and they will think that feelings, perceptions, formative predispositions, and consciousness are imbued with suffering, without self, and unpleasant.

source: །དེ་ལྟར་དེ་དག་གཟུགས་མི་རྟག་གོ་ཞེས་བྱ་བར་རྟོག་པ་དང་གཟུགས་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་བདག་མེད་དོ་ཞེས་བྱ་བ་དང་། མི་སྡུག་གོ་ཞེས་བྱ་བ་དང་། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མི་རྟག་གོ་ཞེས་བྱ་བ་དང་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་བདག་མེད་དོ་ཞེས་བྱ་བ་དང་མི་སྡུག་གོ་ཞེས་བྱ་བར་རྟོག་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གཟུགས་བརྙན་ལ་སྤྱོད་པར་འགྱུར་རོ། །མྱིག་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན།
en: They practice an imitation of the perfection of wisdom because they think that physical forms are impermanent, and because they think that physical forms are imbued with suffering, without self, and unpleasant; because they think that feelings, perceptions, formative predispositions, and consciousness are impermanent; and because they think that feelings, perceptions, formative predispositions, and consciousness are imbued with suffering, without self, and unpleasant. “

source: མྱིག་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་བདག་མེད་དོ་ཞེས་བྱ་བ་དང་མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན།
en: They teach that the eyes are impermanent and they teach that the eyes are imbued with suffering, without self, and unpleasant.

source: རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན། རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་བདག་མེད་དོ་ཞེས་བྱ་བ་དང་མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན། གཟུགས་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན།
en: They teach that the ears, nose, tongue, body, and mental faculty are impermanent, and they teach that the ears, nose, tongue, body, and mental faculty are imbued with suffering, without self, and unpleasant.

source: གཟུགས་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་བདག་མེད་དོ་ཞེས་བྱ་བ་དང་མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན།
en: They teach that sights are impermanent, and they teach that sights are imbued with suffering, without self, and unpleasant.

source: སྒྲ་དང་དྲི་དང་རོ་དང་རེག་དང་ཆོས་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན། སྒྲ་དང་དྲི་དང་རོ་དང་རེག་དང་ཆོས་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་བདག་མེད་དོ་ཞེས་བྱ་བ་དང་མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན།
en: They teach that sounds, odors, tastes, tangibles, and mental phenomena are impermanent, and they teach that sounds, odors, tastes, tangibles, and mental phenomena are imbued with suffering, without self, and unpleasant.

source: མིག་གི་རྣམ་པར་ཤེས་པ་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན། མིག་གི་རྣམ་པར་ཤེས་པ་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་། བདག་མེད་དོ་ཞེས་བྱ་བ་དང་མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན།
en: They teach that visual consciousness is impermanent, and they teach that visual consciousness is imbued with suffering, without self, and unpleasant.
